In [85]:
import pandas as pd

file = '/Users/shrutim/Downloads/data-FDgz9.csv'

In [86]:
cost_living_df = pd.read_csv(file)
cost_living_df.head()

,State,Total Cost of Living<sup>1</sup>,Total Cost Of Living Ranking,Total Disposable Income<sup>2</sup>,Disposable Income Ranking
0,Hawaii,"$55,491",1,"$5,929",50
1,Massachusetts,"$53,860",2,"$22,740",3
2,California,"$53,171",3,"$20,049",15
3,New York,"$49,623",4,"$25,247",1
4,New Jersey,"$49,511",5,"$21,379",10

In [87]:
cost_living_df = cost_living_df.drop(['Total Cost Of Living Ranking',"Total Disposable Income<sup>2</sup>", 'Disposable Income Ranking'], axis= 1)
cost_living_df = cost_living_df.rename(columns={'Total Cost of Living<sup>1</sup>': 'cost_of_living'})
cost_living_df.head()

           State cost_of_living
0         Hawaii        $55,491
1  Massachusetts        $53,860
2     California        $53,171
3       New York        $49,623
4     New Jersey        $49,511

In [88]:
for state in range(len(cost_living_df['cost_of_living'])):
    cost_living_df['cost_of_living'][state] = cost_living_df['cost_of_living'][state].replace('$', '')
    cost_living_df['cost_of_living'][state] = cost_living_df['cost_of_living'][state].replace(',', '')
    cost_living_df['cost_of_living'][state] = int(cost_living_df['cost_of_living'][state])

cost_living_df.head()

           State cost_of_living
0         Hawaii          55491
1  Massachusetts          53860
2     California          53171
3       New York          49623
4     New Jersey          49511

In [93]:
cost_living_df.to_csv('/Users/shrutim/Downloads/cost_living_df.csv', index=False)